In [13]:
import numpy as np
import pandas as pd

In [39]:
test1 = np.empty([0,5])

In [3]:
test1

array([], shape=(0, 5), dtype=float64)

In [40]:
test2 = np.array([[1,2,3,4,5],[6,7,8,9,10]])

In [35]:
test1 = np.array([[5,6,7,8,9],[10,11,12,13,14]])

In [36]:
test1

array([[ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14]])

In [41]:
test1 = np.concatenate((test1,test2), axis=0)

In [42]:
test1

array([[ 1.,  2.,  3.,  4.,  5.],
       [ 6.,  7.,  8.,  9., 10.]])

In [27]:
test1df = pd.DataFrame(test1)

In [28]:
test2df = pd.DataFrame(test2)

In [29]:
test1df

    0   1   2   3   4
0   5   6   7   8   9
1  10  11  12  13  14

In [30]:
test2df

   0  1  2  3   4
0  1  2  3  4   5
1  6  7  8  9  10

In [31]:
hu_concat = pd.concat((test1df, test2df))
hu_mean = hu_concat.groupby(hu_concat.index).mean()

In [32]:
hu_concat

    0   1   2   3   4
0   5   6   7   8   9
1  10  11  12  13  14
0   1   2   3   4   5
1   6   7   8   9  10

In [33]:
hu_mean

   0  1   2   3   4
0  3  4   5   6   7
1  8  9  10  11  12